---
  title: "Afanasova_Dasha_BISO-02-21"
format:
  md:
  output-file: README.md
author: "Afanasova_Dasha"

# Цель работы
1. Развить практические навыки использования современного стека воспроизводимых исследований
2. Закрепить знания о современных сетевых протоколах прикладного уровня
Задание
1. Подготовить рабочее окружение для работы с Rstudio
2. Разработать отчет с использованием стека технологий Rmarkdown и Quarto
3. Оформить отчет в соответствии с шаблоном
Методические рекомендации к оформлению отчетов по практическим и лабораторным работам

1. Вставка кода в отчет

```
def get_vowels(String):
  return [each for each in String if each in "aeiou"]
get_vowels("animal") # [a, i, a]
get_vowels("sky") # []
get_vowels("football") # [o, o, a]

```

2. Вставка изображения в отчет
![](img/3.png)

3. 
